package Ycheba.String;


//Напишите код, который позволяет из строки,
// содержащей значение "Sometimes", напечатать третий символ этого слова.
class ChartAt {
    public static void main(String[] args) {
        String sometimes = "Sometimes";

        System.out.println(sometimes.charAt(2));
    }

}
