package Ycheba.String;

//Напишите код, который сравнивает эти имена и выводит результат сравнения.
//C учетом регистра
class Sravnenie {
    public static void main(String[] args) {
        String user1 = "иван иванов";
        String user2 = "Иван Иванов";
        System.out.print(user1.equals(user2));
    }


}
